app/Controllers/Admin/Produk.php

SELECT *
FROM `produk`
---
    public function index()
    {
        $model = new ProdukModel();
        $data['products'] = $model->findAll();

INSERT INTO `produk` (`nama`, `slug`, `kategori`, `harga`, `stok`, `deskripsi`, `image`, `rating`) VALUES ('Nam ex irure et et e', 'nam-ex-irure-et-et-e', 'Ut dolor architecto ', '77', '3', 'Iste saepe voluptas ', '1765012257_086a39f4f9b5e289e9be.jpg', NULL)
---
        $slug = url_title($this->request->getPost('nama'), '-', true);

        $model = new ProdukModel();
        $model->save([
            'nama' => $this->request->getPost('nama'),
            'slug' => $slug,
            'kategori' => $this->request->getPost('kategori'),
            'harga' => $this->request->getPost('harga'),
            'stok' => $this->request->getPost('stok'),
            'deskripsi' => $this->request->getPost('deskripsi'),
            'image' => $namaFile,
            'rating' => $this->request->getPost('rating') ?: null
        ]);

SELECT *
FROM `produk`
WHERE `produk`.`produk_id` = '1'
---
    public function ubah($id)
    {
        $model = new ProdukModel();
        $produk = $model->find($id);

SELECT *
FROM `produk`
WHERE `produk`.`produk_id` = '1'
---
    public function update($id)
    {
        $model = new ProdukModel();
        $produk = $model->find($id);

DELETE FROM `produk`
WHERE `produk_id` IN ('1')
---
    public function delete($id)
    {
        $model = new ProdukModel();
        $model->delete($id);