app/Controllers/Admin/Users.php

    public function index()
    {
        $model = new UserModel();
        $data['users'] = $model->findAll();
---
SELECT *
FROM `user`

    public function delete($id)
    {
        $model = new UserModel();
        $model->delete($id);
---
DELETE FROM `user`
WHERE `user_id` IN ('7')