app/Controllers/Auth.php

SELECT *
FROM `produk`
ORDER BY `produk_id` DESC
SELECT *
FROM `user`
ORDER BY `user_id` DESC
---
    public function admin()
    {
        // Models
        $produkModel = new \App\Models\ProdukModel();
        $userModel   = new \App\Models\UserModel();

        // DB connection (untuk orders jika tabel ada)
        $db = \Config\Database::connect();

        // Products & Users
        $products = $produkModel->orderBy('produk_id', 'DESC')->findAll();
        $users    = $userModel->orderBy('user_id', 'DESC')->findAll();

SELECT *
FROM `user`
WHERE `full_name` = 'Admin Utama'
OR `email` = 'Admin Utama'
 LIMIT 1
---
    public function loginAuth()
    {
        $session = session();
        $userModel = new UserModel();

        $full_name = $this->request->getPost('full_name');
        $password_hash = $this->request->getPost('password_hash');

        $user = $userModel->where('full_name', $full_name)
            ->orWhere('email', $full_name)
            ->first();